Spaceship Titanic

# Data Analysis and Visualization

In [525]:
import numpy as np 
import pandas as pd 
import matplotlib.pyplot as plt
import re

train = pd.read_csv('/Users/adityajoshi/Documents/VisualStudioCode/VSC/Kaggle Comps/Spaceship Titanic/train-SpaceshipTitanic.csv')
df = pd.DataFrame(train)

In [526]:
print("Descriptive Statistics:\n")
print(df.describe(), "\n")
print("Dimension of Original Train Data:", df.shape)

Descriptive Statistics:

               Age   RoomService     FoodCourt  ShoppingMall           Spa  \
count  8514.000000   8512.000000   8510.000000   8485.000000   8510.000000
mean     28.827930    224.687617    458.077203    173.729169    311.138778
std      14.489021    666.717663   1611.489240    604.696458   1136.705535
min       0.000000      0.000000      0.000000      0.000000      0.000000
25%      19.000000      0.000000      0.000000      0.000000      0.000000
50%      27.000000      0.000000      0.000000      0.000000      0.000000
75%      38.000000     47.000000     76.000000     27.000000     59.000000
max      79.000000  14327.000000  29813.000000  23492.000000  22408.000000

             VRDeck
count   8505.000000
mean     304.854791
std     1145.717189
min        0.000000
25%        0.000000
50%        0.000000
75%       46.000000
max    24133.000000

Dimension of Original Train Data: (8693, 14)

In [527]:
print("number of null values in each column:\n")
df.isnull().sum()

number of null values in each column:

PassengerId       0
HomePlanet      201
CryoSleep       217
Cabin           199
Destination     182
Age             179
VIP             203
RoomService     181
FoodCourt       183
ShoppingMall    208
Spa             183
VRDeck          188
Name            200
Transported       0
dtype: int64

In [528]:
print("Number of unique values in each column:\n")
df.nunique()

Number of unique values in each column:

PassengerId     8693
HomePlanet         3
CryoSleep          2
Cabin           6560
Destination        3
Age               80
VIP                2
RoomService     1273
FoodCourt       1507
ShoppingMall    1115
Spa             1327
VRDeck          1306
Name            8473
Transported        2
dtype: int64

In [529]:
print("Number of duplicate rows:\n")
df.duplicated().sum()

Number of duplicate rows:

0

In [530]:
print("Columns with missing Name values:\n")
df[df["Name"].isna()]

Columns with missing Name values:

,PassengerId,HomePlanet,CryoSleep,Cabin,Destination,Age,VIP,RoomService,FoodCourt,ShoppingMall,Spa,VRDeck,Name,Transported
27,0022_01,Mars,False,D/0/P,TRAPPIST-1e,21.0,False,980.0,2.0,69.0,0.0,0.0,NaN,False
58,0064_01,Mars,True,F/14/S,TRAPPIST-1e,15.0,False,0.0,0.0,0.0,0.0,0.0,NaN,True
65,0069_01,Earth,False,F/16/S,TRAPPIST-1e,42.0,False,887.0,0.0,9.0,6.0,0.0,NaN,True
77,0082_03,Mars,False,F/16/P,TRAPPIST-1e,8.0,False,0.0,0.0,0.0,0.0,0.0,NaN,True
101,0108_02,Earth,False,G/19/S,TRAPPIST-1e,31.0,False,562.0,0.0,326.0,0.0,0.0,NaN,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
8629,9205_02,Europa,True,B/300/P,TRAPPIST-1e,15.0,False,0.0,0.0,0.0,0.0,0.0,NaN,True
8631,9208_01,Earth,True,G/1485/S,TRAPPIST-1e,35.0,False,0.0,0.0,0.0,0.0,0.0,NaN,True
8636,9218_01,Europa,True,B/353/S,55 Cancri e,43.0,False,0.0,0.0,0.0,0.0,0.0,NaN,True
8652,9230_01,Europa,False,C/342/S,TRAPPIST-1e,36.0,True,0.0,5600.0,715.0,2868.0,971.0,NaN,True
8664,9246_01,Earth,NaN,G/1490/S,TRAPPIST-1e,32.0,False,0.0,0.0,0.0,0.0,0.0,NaN,True

In [531]:
print("Since the Name column is not a useful feature for predicting survival but the data in the rest of the row is valuable, we should replace the Nan with John Doe. Then we will split the Name Column into First and Last Name Column since the family name can be a useful indicator for survival\n")

Since the Name column is not a useful feature for predicting survival but the data in the rest of the row is valuable, we should replace the Nan with John Doe. Then we will split the Name Column into First and Last Name Column since the family name can be a useful indicator for survival

In [532]:
temp = train.copy()
temp["Name"] = temp["Name"].fillna("John Doe")

temp['first_name'], temp['last_name'] = zip(*temp['Name'].apply(lambda x: re.split(r'\s+', x)))
temp.drop(columns = "Name", inplace = True)
temp.drop(columns = "first_name", inplace = True)

print("Number of null values in each column after 1st transformation:\n")
print(temp.isna().sum())
df = temp.copy()

Number of null values in each column after 1st transformation:

PassengerId       0
HomePlanet      201
CryoSleep       217
Cabin           199
Destination     182
Age             179
VIP             203
RoomService     181
FoodCourt       183
ShoppingMall    208
Spa             183
VRDeck          188
Transported       0
last_name         0
dtype: int64

In [533]:
df.head()

,PassengerId,HomePlanet,CryoSleep,Cabin,Destination,Age,VIP,RoomService,FoodCourt,ShoppingMall,Spa,VRDeck,Transported,last_name
0,0001_01,Europa,False,B/0/P,TRAPPIST-1e,39.0,False,0.0,0.0,0.0,0.0,0.0,False,Ofracculy
1,0002_01,Earth,False,F/0/S,TRAPPIST-1e,24.0,False,109.0,9.0,25.0,549.0,44.0,True,Vines
2,0003_01,Europa,False,A/0/S,TRAPPIST-1e,58.0,True,43.0,3576.0,0.0,6715.0,49.0,False,Susent
3,0003_02,Europa,False,A/0/S,TRAPPIST-1e,33.0,False,0.0,1283.0,371.0,3329.0,193.0,False,Susent
4,0004_01,Earth,False,F/1/S,TRAPPIST-1e,16.0,False,303.0,70.0,151.0,565.0,2.0,True,Santantines

In [534]:
print("Now we split PassengerId into two columns, group and pp, where group is the group number and pp is the passenger number within the group. Also insure that the new columns are integers\n")
print("The PassengerId is in the form group_pp\n")

temp = df.copy()
temp["group"], temp["pp"] = zip(*temp["PassengerId"].apply(lambda x: re.split(r'_+', x)))
temp["group"] = pd.Series(data = temp["group"]).round(0).astype(int)    
temp["pp"] = pd.Series(data = temp["pp"]).round(0).astype(int)    
temp.drop(columns = "PassengerId", inplace = True)
df1 = temp.copy()
df1.describe()

Now we split PassengerId into two columns, group and pp, where group is the group number and pp is the passenger number within the group. Also insure that the new columns are integers

The PassengerId is in the form group_pp

,Age,RoomService,FoodCourt,ShoppingMall,Spa,VRDeck,group,pp
count,8514.000000,8512.000000,8510.000000,8485.000000,8510.000000,8505.000000,8693.000000,8693.000000
mean,28.827930,224.687617,458.077203,173.729169,311.138778,304.854791,4633.389624,1.517773
std,14.489021,666.717663,1611.489240,604.696458,1136.705535,1145.717189,2671.028856,1.054241
min,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,1.000000,1.000000
25%,19.000000,0.000000,0.000000,0.000000,0.000000,0.000000,2319.000000,1.000000
50%,27.000000,0.000000,0.000000,0.000000,0.000000,0.000000,4630.000000,1.000000
75%,38.000000,47.000000,76.000000,27.000000,59.000000,46.000000,6883.000000,2.000000
max,79.000000,14327.000000,29813.000000,23492.000000,22408.000000,24133.000000,9280.000000,8.000000

In [535]:
print("Next we deal with the NaN values in the Age column. We will replace the NaN values with the mean/median of the Age column\n")

temp = df1.copy()

print("Mean of Age:",temp["Age"].mean())
print("\n")
print("Meadian of Age",temp["Age"].median())

Next we deal with the NaN values in the Age column. We will replace the NaN values with the mean/median of the Age column

Mean of Age: 28.82793046746535


Meadian of Age 27.0

In [536]:
print("Ensure that the Age column does not have any numbers after decimal point and can be treated as an integer. Then replace NaN values with the median age\n")
fractional_rows = df1.loc[df1['Age'].notna() & (df1['Age'] % 1 != 0)]
print(fractional_rows)

temp["Age"] = temp["Age"].fillna(temp["Age"].median())
temp["Age"] = pd.Series(data = temp["Age"]).round(0).astype(int)
temp.head()

df2 = temp.copy()

Ensure that the Age column does not have any numbers after decimal point and can be treated as an integer. Then replace NaN values with the median age

Empty DataFrame
Columns: [HomePlanet, CryoSleep, Cabin, Destination, Age, VIP, RoomService, FoodCourt, ShoppingMall, Spa, VRDeck, Transported, last_name, group, pp]
Index: []

In [538]:
df2.isnull().sum()  
df2.head()

,HomePlanet,CryoSleep,Cabin,Destination,Age,VIP,RoomService,FoodCourt,ShoppingMall,Spa,VRDeck,Transported,last_name,group,pp
0,Europa,False,B/0/P,TRAPPIST-1e,39,False,0.0,0.0,0.0,0.0,0.0,False,Ofracculy,1,1
1,Earth,False,F/0/S,TRAPPIST-1e,24,False,109.0,9.0,25.0,549.0,44.0,True,Vines,2,1
2,Europa,False,A/0/S,TRAPPIST-1e,58,True,43.0,3576.0,0.0,6715.0,49.0,False,Susent,3,1
3,Europa,False,A/0/S,TRAPPIST-1e,33,False,0.0,1283.0,371.0,3329.0,193.0,False,Susent,3,2
4,Earth,False,F/1/S,TRAPPIST-1e,16,False,303.0,70.0,151.0,565.0,2.0,True,Santantines,4,1